Revit 2024 API
InstanceVoidCutUtils Class
 Utilities for cutting elements by unattached voids in family instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static class InstanceVoidCutUtils
Visual Basic
Public NotInheritable Class InstanceVoidCutUtils
Visual C++
public ref class InstanceVoidCutUtils abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.InstanceVoidCutUtils
See Also
InstanceVoidCutUtils Members
Autodesk.Revit.DB Namespace